# F15 데이터베이스

In [ ]:
# 프로그램 구성
# 파일 이름 입력받기
# 읽기모드로 파일을 열어 한 줄씩 입력받기
# 파일의 각 행의 데이터 속성을 갖는 인스턴스 객체 만들기(사원객체)
# employee 클래스 설계 필요
# 인스턴스 사원 객체 만드는 함수 필요
# 월급이 가장 높은 사원을 찾는 코드 구현
# 결과 출력

In [6]:
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0
    # 텍스트 파일에서 불러온 각각의 데이터는 string으로 처리됩니다. 형변환이 필요
    def get_name(self):
        return self.name
    def get_division(self):
        return self.division
    def get_jobgrade(self):
        return self.jobgrade
    def get_years(self):
        return self.years
    def get_basic(self):
        return self.basic
    def get_salary(self):
        self.salary = self.basic + self.years * self.basic * 0.1
        return self.salary

# 텍스트 파일에서 불러온 데이터를 자동으로 인스턴스 객체로 만드는 함수    
def make_employee(inputdata):
    name, division, jobgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jobgrade, year, basic)

def summarize():
    file_path = os.getenv("HOME") + '/aiffel/data_handling/data/employeefile.txt'
    inputfile = open(file_path, 'r')
    highest = make_employee(inputfile.readline())
    for l in inputfile:
        e = make_employee(l)
        if e.get_salary() > highest.get_salary():
            highest = e
    inputfile.close()
    
    print("The name of the highest salary employee is: ", highest.get_name())
    print("Years of service: ", highest.get_years())
    print("Division: ", highest.get_division())
    print("Salay: ", highest.get_salary())

In [7]:
summarize()

The name of the highest salary employee is:  Kim YoungJae
Years of service:  7
Division:   Sales
Salay:  1020.0

In [16]:
# Pandas는 SQL와 유사한 기능을 수행하며 데이터 조작이 가능하다.
# 연관된 컬럼이 있는 경우 그 컬럼을 키(key)로 지정해 합치기 연산이 가능
# 관련 메소드 : merge(), join(), concat()

# pd.merge() : 공통의 칼럼을 key로 사용하여 데이터를 합쳐준다. (Student)
import pandas as pd

df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Math': [100, 55, 38, 43, 68, 82]})

print(df1)
print('---------------------------------')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
---------------------------------
       Student  Math
0    KimTaemin   100
1     HaJaehwa    55
2  JungSayoung    38
3     Sonjimin    43
4    Leesoomin    68
5      KangJun    82

In [9]:
pd.merge(df1, df2)
# pd.merge(df1, df2, on='Student') 공통컬럼을 on으로 명시 가능.

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [19]:
# 공통컬럼에 겹치는 행이 일부만 있을 경우, inner join사용 가능
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','KimTaemin'],
                    'Math':[44,33]})

print(df1)
print('--------------------------------')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
--------------------------------
      Student  Math
0  Jiyoungmin    44
1   KimTaemin    33

In [11]:
# how 기본값은 inner
pd.merge(df1, df2, how='inner')

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [28]:
pd.merge(df1, df2)

Empty DataFrame
Columns: [Student, Korean, English]
Index: []

In [12]:
# 일부 행만 있더라도 전체 행을 합치는 경우, outer join사용 가능
pd.merge(df1, df2, how='outer')

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0  33.0
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
6   Jiyoungmin     NaN      NaN  44.0

In [13]:
# pd.join()사용하여 합치기
# '_caller'인 df1 컬럼이 왼쪽에 가도록 배치
df1.join(df2, how='outer', lsuffix='_caller', rsuffix='_other')

  Student_caller  Korean  English Student_other  Math
0      KimTaemin      90       80    Jiyoungmin  44.0
1       HaJaehwa      85       90     KimTaemin  33.0
2    JungSayoung      88       40           NaN   NaN
3       Sonjimin      35       44           NaN   NaN
4      Leesoomin      40       55           NaN   NaN
5        KangJun      44       90           NaN   NaN

In [23]:
# pd.concat()사용하여 이어서 붙히기
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','LeeJae','KimJaehee'],
                    'Korean': [44,73,100]})

print(df1)
print('--------------------------------')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
--------------------------------
      Student  Korean
0  Jiyoungmin      44
1      LeeJae      73
2   KimJaehee     100

In [24]:
pd.concat([df1, df2], sort=False)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
0   Jiyoungmin      44      NaN
1       LeeJae      73      NaN
2    KimJaehee     100      NaN

In [25]:
# 기존 인덱스 무시하고 순서대로 지정
pd.concat([df1, df2], sort=False, ignore_index=True)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
6   Jiyoungmin      44      NaN
7       LeeJae      73      NaN
8    KimJaehee     100      NaN

In [29]:
# pandas는 데이터 필터링 가능, index 존재
df = pd.DataFrame({"A": [1,4,7], "B": [2,5,8], "C":[3,6,9]})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [30]:
df['A']

0    1
1    4
2    7
Name: A, dtype: int64

In [41]:
# loc()은 라벨을 사용하여 행 또는 열을 지정
# df.loc[[행],[열]]
print(df.loc[0])
print(df.loc[1], '\n')
print(df.loc[0, 'B'], '\n')
print(df.loc[:, 'A'])

A    1
B    2
C    3
Name: 0, dtype: int64
A    4
B    5
C    6
Name: 1, dtype: int64

2

0    1
1    4
2    7
Name: A, dtype: int64

In [45]:
# iloc()은 정수 인덱스를 사용하여 행 또는 열을 지정
# df.iloc[[행],[열]]
print(df.iloc[0])
print(df.iloc[1], '\n')
print(df.iloc[0, 1], '\n')
print(df.iloc[:, 0])

A    1
B    2
C    3
Name: 0, dtype: int64
A    4
B    5
C    6
Name: 1, dtype: int64

2

0    1
1    4
2    7
Name: A, dtype: int64

In [46]:
# 그룹연산 : groupby(), apply()
# 기준이 되는 컬럼(key)로 그룹화시킨다.
df = pd.DataFrame({'Columns1':['A','A','B','B','C','C','A','B'],
                   'Columns2':[10, 2, 30, -6, 8, 9, 5, 2]})

df

  Columns1  Columns2
0        A        10
1        A         2
2        B        30
3        B        -6
4        C         8
5        C         9
6        A         5
7        B         2

In [60]:
# max(), min(), sum(), mean()
df.groupby('Columns1').max()

          Columns2
Columns1
A               10
B               30
C                9

In [59]:
# apply()을 사용하여 특수 수식에 대한 연산 수행 가능
import numpy as  np
df.groupby(['Columns1']).max().apply(np.sqrt)

          Columns2
Columns1
A         3.162278
B         5.477226
C         3.000000

## Pandas Transform

In [61]:
import pandas as pd
import numpy as np

file_path = os.getenv("HOME") + '/aiffel/data_handling/data/Salaries.csv'
sal = pd.read_csv(file_path)

/home/aiffel0042/anaconda3/envs/aiffel/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [103]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148640,148641,Charlene D Mccully,Parking Control Officer,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148641,148642,Raphael Marquis Goins,Museum Guard,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148642,148643,Dominic C Marquez,Sign Worker,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148643,148644,Kim Brewer,Parking Control Officer,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT

In [72]:
sal['BasePay'].mean()

66327.6889596918

In [73]:
sal['OvertimePay'].max()

245131.88

In [89]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [101]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [108]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [109]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]['EmployeeName']

110530    David P Kucia
Name: EmployeeName, dtype: object

In [112]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66573.154204
Name: BasePay, dtype: float64

In [116]:
sal['JobTitle'].nunique()

2158

In [133]:
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [146]:
def chief_string(str):
    if 'chief' in str.lower().split():
        return True
    else:
        return False
    
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

477

## 데이터베이스와 python

In [148]:
# db에 접속할 수 있는 모듈을 불러오기
# splite3 접속하기

#import sqlite3
#conn = sqlite3.connect('example.db')

# mysql 접속하기
# import MySQLdb
# conn = MySQLdb.connect(host='localhost', port=3308, db='example.db', user='root',
# passwd='1234')

# 커서 객체 만들기
#c = conn.cursor()

# 쿼리 명령어
# Create table
#c.execute('''CREATE TABLE stocks
#             (date text, trans text, symbol text, qty real, price real)''')

# Insert a row of data
#c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")

# db에 반영하기
#conn.commit()

# db연결 종료하기
#conn.close()

In [151]:
import sqlite3

# 메모리에 SQLite3DB만들기
conn = sqlite3.connect(':memory:')
query = """CREATE TABLE sales
            (product VARCHAR(20),
            maker VARCHAR(40),
            amount FLOAT,
            date DATE);"""
conn.execute(query)
conn.commit()

In [152]:
# sales테이블에 데이터 입력하기
data = [('smart phone', 'Apple', '47.2', '2019-08-03'),
        ('printer', 'Samsung', '15.2', '2018-02-10',),
        ('monitor', 'LG', '14.25', '2019-12-20'),
        ('python book', 'Amazon', '12.40', '2020-01-23')]
statement = "INSERT INTO sales VALUES(?, ?, ?, ?)"
conn.executemany(statement, data)
conn.commit()

In [153]:
# sales테이블에 질의하기
cursor = conn.execute("SELECT * FROM sales")
rows = cursor.fetchall()

In [154]:
# 데이터 처리하기
row_counter = 0
for row in rows:
    print(row)
    row_counter +=1

print("Number of rows: {}".format(row_counter))

('smart phone', 'Apple', 47.2, '2019-08-03')
('printer', 'Samsung', 15.2, '2018-02-10')
('monitor', 'LG', 14.25, '2019-12-20')
('python book', 'Amazon', 12.4, '2020-01-23')
Number of rows: 4